dannyf00/Another-Arduino-Clone/pic32duino.c
}

void uart2Putch(char ch) {
	while (U2STAbits.UTXBF) continue;	//wait if the tx buffer is full

	//Write data
	U2TXREG=ch;				//load up the tx register

	//while(!TRMT);			//wait for the transmission to finish
							//don't use txif as this is not back-to-back transmission
	//USART_WAIT(U1STAbits.TRMT);
}

void uart2Puts(char *str) {
	while(*str) {
		uart2Putch(*str++);	//send the ch and advance the pointer
	}
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

void uart2Putline(char *ln) {
	//USARTWriteString(ln);
	uart2Puts(ln);
	//USARTWriteString("\r\n");
	uart2Puts((char *)"\r\n");
}

uint8_t uart2Getch(void) {
	//while(!RCIF); RCIF=0;		//Wait for a byte
	//USART_WAIT(U1STAbits.TRMT);		//wait for the prior transmission to end

	return U2RXREG;		//return it
}

//test if data rx is available
uint16_t uart2Available(void) {
	return U2STAbits.URXDA;
}

//test if uart tx is busy
uint16_t uart2Busy(void) {
	return U2STAbits.UTXBF;
}
//end Serial

//tmr1
//global variables
static void (* _tmr1_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void __ISR(_TIMER_1_VECTOR/*, TxIPL*/) _T1Interrupt(void) {
	IFS0bits.T1IF=0;							//clear tmr1 interrupt flag
	_tmr1_isrptr();								//execute user tmr1 isr
}

//initialize the timer1 (16bit)
void tmr1Init(uint8_t ps, uint16_t period) {
	_tmr1_isrptr=empty_handler;					//point to default handler

	PMD4bits.T1MD = 0;							//enable power to tmr
	T1CONbits.TON = 0;							//turn off rtc1
	T1CONbits.TCS = 0;							//use internal clock = Fosc
	//T1CONbits.T32 = 0;						//0->16 bit timer, 1->32bit timer
	T1CONbits.TCKPS=ps & TMR1_PSMASK;			//set prescaler to 1:1
	T1CONbits.TGATE = 0;						//rtc1 gate disabled
	TMR1 = 0;									//reset the timer/counter
	PR1=period-1;								//minimum rtc resolution is 1ms
	IFS0bits.T1IF = 0;							//reset the flag
	IEC0bits.T1IE = 0;							//rtc1 interrupt off
	T1CONbits.TON = 1;							//turn on rtc1
}

//activate the isr handler
void tmr1AttachISR(void (*isrptr)(void)) {
	_tmr1_isrptr=isrptr;						//activate the isr handler
	IPC1bits.T1IP = TMR_IPDEFAULT;
	IPC1bits.T1IS = TMR_ISDEFAULT;
	IFS0bits.T1IF = 0;							//reset the flag
	IEC0bits.T1IE = 1;							//rtc1 interrupt on
}

//tmr2
//global variables
static void (* _tmr2_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void __ISR(_TIMER_2_VECTOR/*, TxIPL*/) _T2Interrupt(void) {
	IFS0bits.T2IF=0;							//clear tmr1 interrupt flag
	_tmr2_isrptr();								//execute user tmr2 isr
}

//initialize the timer2 (16bit)
void tmr2Init(uint8_t ps, uint16_t period) {
	_tmr2_isrptr=empty_handler;					//point to default handler

	PMD4bits.T2MD = 0;							//enable power to tmr
	T2CONbits.TON = 0;							//turn off rtc1
	T2CONbits.TCS = 0;							//use internal clock = Fosc
	T2CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T2CONbits.TCKPS=ps & TMR_PSMASK;			//set prescaler to 1:1
	T2CONbits.TGATE = 0;						//rtc1 gate disabled
	TMR2 = 0;									//reset the timer/counter
	PR2=period-1;								//minimum rtc resolution is 1ms
	IFS0bits.T2IF = 0;							//reset the flag
	IEC0bits.T2IE = 0;							//rtc1 interrupt off
	T2CONbits.TON = 1;							//turn on rtc1
}

//activate the isr handler
void tmr2AttachISR(void (*isrptr)(void)) {
	_tmr2_isrptr=isrptr;						//activate the isr handler
	IPC2bits.T2IP = TMR_IPDEFAULT;
	IPC2bits.T2IS = TMR_ISDEFAULT;
	IFS0bits.T2IF = 0;							//reset the flag
	IEC0bits.T2IE = 1;							//rtc1 interrupt on
}

//tmr3
//global variables
static void (* _tmr3_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void __ISR(_TIMER_3_VECTOR/*, TxIPL*/) _T3Interrupt(void) {
	IFS0bits.T3IF=0;							//clear tmr1 interrupt flag
	_tmr3_isrptr();								//execute user tmr1 isr
}

//initialize the timer3 (16bit)
void tmr3Init(uint8_t ps, uint16_t period) {
	_tmr3_isrptr=empty_handler;					//point to default handler

	PMD4bits.T3MD = 0;							//enable power to tmr
	T3CONbits.TON = 0;							//turn off rtc1
	T3CONbits.TCS = 0;							//use internal clock = Fosc
	//T3CONbits.T32 = 0;						//0->16 bit timer, 1->32bit timer
	T3CONbits.TCKPS=ps & TMR_PSMASK;			//set prescaler to 1:1
	T3CONbits.TGATE = 0;						//rtc1 gate disabled
	TMR3 = 0;									//reset the timer/counter
	PR3=period-1;								//minimum rtc resolution is 1ms
	IFS0bits.T3IF = 0;							//reset the flag
	IEC0bits.T3IE = 0;							//rtc1 interrupt off
	T3CONbits.TON = 1;							//turn on rtc1
}

//activate the isr handler
void tmr3AttachISR(void (*isrptr)(void)) {
	_tmr3_isrptr=isrptr;						//activate the isr handler
	IPC3bits.T3IP = TMR_IPDEFAULT;
	IPC3bits.T3IS = TMR_ISDEFAULT;
	IFS0bits.T3IF = 0;							//reset the flag
	IEC0bits.T3IE = 1;							//rtc1 interrupt on
}

//tmr4
//global variables
static void (* _tmr4_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

//interrupt service routine
void __ISR(_TIMER_4_VECTOR/*, TxIPL*/) _T4Interrupt(void) {
	IFS0bits.T4IF=0;							//clear tmr1 interrupt flag
	_tmr4_isrptr();								//execute user tmr1 isr
}

//initialize the timer4 (16bit)
void tmr4Init(uint8_t ps, uint16_t period) {
	_tmr4_isrptr=empty_handler;					//point to default handler

	PMD4bits.T4MD = 0;							//enable power to tmr
	T4CONbits.TON = 0;							//turn off rtc1
	T4CONbits.TCS = 0;							//use internal clock = Fosc
	T4CONbits.T32 = 0;							//0->16 bit timer, 1->32bit timer
	T4CONbits.TCKPS=ps & TMR_PSMASK;			//set prescaler to 1:1
	T4CONbits.TGATE = 0;						//rtc1 gate disabled
	TMR4 = 0;									//reset the timer/counter
	PR4=period-1;								//minimum rtc resolution is 1ms
	IFS0bits.T4IF = 0;							//reset the flag
	IEC0bits.T4IE = 0;							//rtc1 interrupt off
	T4CONbits.TON = 1;							//turn on rtc1
}

//activate the isr handler
void tmr4AttachISR(void (*isrptr)(void)) {
	_tmr4_isrptr=isrptr;						//activate the isr handler
	IPC4bits.T4IP = TMR_IPDEFAULT;
	IPC4bits.T4IS = TMR_ISDEFAULT;
	IFS0bits.T4IF = 0;							//reset the flag
	IEC0bits.T4IE = 1;							//rtc1 interrupt on
}

//tmr5
//global variables
static void (* _tmr5_isrptr)(void)=empty_handler;				//tmr1_ptr pointing to empty_handler by default

