dannyf00/Another-Arduino-Clone/pic32duino.c
//interrupt service routine
void __ISR(_TIMER_5_VECTOR/*, TxIPL*/) _T5Interrupt(void) {
	IFS0bits.T5IF=0;							//clear tmr1 interrupt flag
	_tmr5_isrptr();								//execute user tmr1 isr
}

//initialize the timer5 (16bit)
void tmr5Init(uint8_t ps, uint16_t period) {
	_tmr5_isrptr=empty_handler;					//point to default handler

	PMD4bits.T5MD = 0;							//enable power to tmr
	T5CONbits.TON = 0;							//turn off rtc1
	T5CONbits.TCS = 0;							//use internal clock = Fosc
	//T5CONbits.T32 = 0;						//0->16 bit timer, 1->32bit timer
	T5CONbits.TCKPS=ps & TMR_PSMASK;			//set prescaler to 1:1
	T5CONbits.TGATE = 0;						//rtc1 gate disabled
	TMR5 = 0;									//reset the timer/counter
	PR5=period-1;								//minimum rtc resolution is 1ms
	IFS0bits.T5IF = 0;							//reset the flag
	IEC0bits.T5IE = 0;							//rtc1 interrupt off
	T5CONbits.TON = 1;							//turn on rtc1
}

//activate the isr handler
void tmr5AttachISR(void (*isrptr)(void)) {
	_tmr5_isrptr=isrptr;						//activate the isr handler
	IPC5bits.T5IP = TMR_IPDEFAULT;
	IPC5bits.T5IS = TMR_ISDEFAULT;
	IFS0bits.T5IF = 0;							//reset the flag
	IEC0bits.T5IE = 1;							//rtc1 interrupt on
}
//end Timer

//define pwm functions
//time base is Timer2, defined in mcu_init()

//pwm1/oc1
//reset pwm
void pwm1Init(void) {
	//power up the pwm module
	PMD3bits.OC1MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM12RP();

    //tris pin presumed to have been set to output

	//OCxCON1 register settings
	//reset the registers
	OC1CON = 0x0000;
	//OC1CON2 = 0x0000;
    OC1CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC1CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC1R = OC1RS = 0;						//reset the duty cycle registers
    OC1CONbits.ON= 1;						//1->turn on oc, 0->turn off oc
}


//pwm2/oc2
//reset pwm
void pwm2Init(void) {
	//power up the pwm module
	PMD3bits.OC2MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM22RP();

    //tris pin presumed to have been set to output

	//OCxCON1 register settings
	//reset the registers
	OC2CON = 0x0000;
	//OC2CON2 = 0x0000;
    OC2CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC2CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC2R = OC2RS = 0;						//reset the duty cycle registers
    OC2CONbits.ON= 1;						//1->turn on oc, 0->turn off oc
}


//pwm3/oc3
//reset pwm
void pwm3Init(void) {
	//power up the pwm module
	PMD3bits.OC3MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM32RP();

    //tris pin presumed to have been set to output

	//OCxCON1 register settings
	//reset the registers
	OC3CON = 0x0000;
	//OC3CON2 = 0x0000;
    OC3CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC3CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC3R = OC3RS = 0;						//reset the duty cycle registers
    OC3CONbits.ON= 1;						//1->turn on oc, 0->turn off oc
}


//pwm4/oc4
//reset pwm
void pwm4Init(void) {
	//power up the pwm module
	PMD3bits.OC4MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM42RP();

    //tris pin presumed to have been set to output

	//OCxCON1 register settings
	//reset the registers
	OC4CON = 0x0000;
	//OC4CON2 = 0x0000;
    OC4CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC4CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC4R = OC4RS = 0;						//reset the duty cycle registers
    OC4CONbits.ON= 1;						//1->turn on oc, 0->turn off oc
}


//pwm5/oc5
//reset pwm
void pwm5Init(void) {
	//power up the pwm module
	PMD3bits.OC5MD = 0;						//0->turn on the peripheral, 1->turn off the peripheral

	//assign the output pins
	PWM52RP();

    //tris pin presumed to have been set to output

	//OCxCON1 register settings
	//reset the registers
	OC5CON = 0x0000;
	//OC5CON2 = 0x0000;
    OC5CONbits.OCM = 0x06;					//0b110 -> pwm on OCx, fault pin disabled, 0b111->pwm on OCx, fault pin enabled
    OC5CONbits.OCTSEL = 0;					//0->timebase = timer2, 1->timebase = timer3
    OC5R = OC5RS = 0;						//reset the duty cycle registers
    OC5CONbits.ON= 1;						//1->turn on oc, 0->turn off oc
}

//end pwm/oc

//adc module
//rest the adc
//automatic sampling (ASAM=1), manual conversion
void adcInit(void) {
	PMD1bits.AD1MD = 0;						//0->enable peripheral, 1->disable peripheral
	//turn off the adc
	AD1CON1bits.ON = 0;				//0->adc off, 1->adc on

	//configure the adc
	AD1CON1 = 0;
	AD1CON2 = 0;
	AD1CON3 = 0;
#if 1
	AD1CON1 = 	(0<<15) |			//0->adc off, 1->adc on
				(0<<14) |			//0->continue adc operation in debug, 1->freeze operation when cpu enters debug
				(0<<13) |			//0->continue operation in idle, 1->stop operation in idle
				(0<< 8) |			//0->16-bit int, 1->16-bit signed, 2->fractional 16-bit, 3->signed fractional 16-bit, 4->32-bit int, 5->signed 32-bit int, 6->fractional 32-bit int, 7->signed fractional 32-bit int
				//7=automatic conversion
				(7<< 5) |			//0->SAMP triggers sampling, 1->int0 transition triggers adc, 2->timer3 period match triggers sampling, 7->internal counter triggers sampling
				(0<< 4) |			//0->normal operation, 1->stop conversions when the first adc interrupt is generated
				//0=manual sampling
				(1<< 2) |			//0->sampling begins when SAMP is set, 1->sampling begins immediately after last conversion (=continuous mode)
				(0<< 1) |			//0->adc sample/hold amplifier is holding, 1->adc sha is sampling. when asam = 0, writing 1 to this bit starts sampling
				(0<< 0) |			//0->adc conversion is not done, 1->adc conversion is done
				0x00;
	AD1CON2 = 	(0<<13) |			//0->AVDD-AVss, 1->Vref+ - AVss, 2->AVdd - Vref-, 3->Vref+ - Vref-, 4..7->AVdd - AVss
				(0<<12) |			//0->disable offset calibration mode, 1->enable offset calibration mode (VinH and VinL are connected to VR-)
				(0<<10) |			//0->do not scan inputs, 1->scan inputs
				(0<< 7) |			//0->ADC is current filling buffer 0-7, user should access data in 8-15; 1->ADC is currently filling buffer 8-15,  user should access data in 0-7
				(0<< 2) |			//0->interrupt at end of each conversion, 1->interrupt at end of every 2nd conversion, 2->interrupt every 3rd conversion, ...
				(0<< 1) |			//0->buffer configured as one 16-word buffer (ADC1BUF15..0), 1->buffer configured as two 8-word buffer (ADC1BUF7..0, ADC1BUF15..8)
				(0<< 0) |			//0->always use mux a input settings, 1->uses muxA for first sample, then alternate between muxA and muxB
				0x00;
	AD1CON3 = 	(0<<15) |			//0->clock derived from peripheral bus clock, 1->adc internal rc clock
				(1<< 8) |			//0->not allowed, 1->1TAD, 2->2TAD, ..., 31->31Tad
				(2<< 0) |			//0->Tad=2*TPB, 1->Tad=4Tpb, ..., Tad=512*TPB
				0x00;
#else
	//alternative approach -> easier to read but longer code
	AD1CON1bits.ON = 0;				//0->disable adc, 1->enable adc
	AD1CON1bits.FORM = 0;			//0->16 bit integer
	AD1CON1bits.SSRC = 7;			//0..7. 7=auto convert
	AD1CON1bits.ASAM = 1;			//1->continuous mode; 0->adc begins when SAMP is set
	
	AD1CON2bits.VCFG = 0;			//0..3. adc voltage referernce: 0->VAdd-VAss
	AD1CON2bits.ALTS = 0;			//0->always use mux a. 1->use mux a/b alternately
	
	AD1CON3bits.ADRC = 0;			//0->use pheripheral clock; 1->use adc rc clock
	AD1CON3bits.SAMC = 1;			//auto sample time bits. 0..31
	AD1CON3bits.ADCS = 2;			//auto conversation clock selection. 0..256
#endif
	//AD1CON3 = 0x0002;
	AD1CSSL = 0;					//0->no scaning
	//use muxA always
	//negative input is VR-
	AD1CHSbits.CH0NA = 0;			//0->ch0 negative is VR-, 1->ch0 negative is AN1

	//turn on the adc
	AD1CON1bits.ON = 1;				//0->adc off, 1->adc on
}

//read the adc
uint16_t analogRead(uint16_t ch) {
	int i;

	AD1CON1bits.SAMP = 0;			// |= (1<<1);			//1->set SAMP to start sampling, 0->stop sampling and start conversion
	ch = ch & 0x0f;					//0..15 is valid input
	//pin lay-out may change
	//below is for pic32mx1xx/2xx/3xx pdip
	switch (ch) {
		case ADC_AN0: ANSELA |= (1<<0); break;	//AN0 = RA0
		case ADC_AN1: ANSELA |= (1<<1); break;	//AN1 = RA1
		case ADC_AN2: ANSELB |= (1<<0); break;	//AN2 = RB0
		case ADC_AN3: ANSELB |= (1<<1); break;	//AN3 = RB1
		case ADC_AN4: ANSELB |= (1<<2); break;	//AN4 = RB2
		case ADC_AN5: ANSELB |= (1<<3); break;	//AN5 = RB3
#if defined(_PORTC)
		case ADC_AN6: ANSELC |= (1<<0); break;	//AN6 = RC0
		case ADC_AN7: ANSELC |= (1<<1); break;	//AN7 = RC1
		case ADC_AN8: ANSELC |= (1<<2); break;	//AN8 = RC2
#endif
		case ADC_AN9: ANSELB |= (1<<15); break;	//AN9 = RB15
		case ADC_AN10:ANSELB |= (1<<14); break;	//AN10= RB14
		case ADC_AN11:ANSELB |= (1<<13); break;	//AN11= RB13
		case ADC_AN12:ANSELB |= (1<<12); break;	//AN12= RB12
		//case ADC_AN13:ANSELB |= (1<<0); break;	//AN13= CTMUT
		//case ADC_AN14:ANSELB |= (1<<0); break;	//AN14= Internal Vref
		//case ADC_AN15:ANSELB |= (1<<0); break;	//AN15= Open
	}
	AD1CHSbits.CH0SA = ch;			//set Ch0 positive input
	//start the conversion
	//for (i=0; i<10000; i++);
	AD1CON1bits.SAMP = 1;			// |= (1<<1);			//1->set SAMP to start sampling, 0->stop sampling and start conversion
	//clear the DONE bit -> it is persistent in manual mode
	//AD1CON1bits.DONE = 0;
	//wait for the previous conversion to end
	while (AD1CON1bits.DONE == 0) continue;	//0->conversion on going, 1->conversion done
	return ADC1BUF0;
}
//end ADC

//input capture
static void (*_ic1_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
volatile uint16_t IC1DAT=0;				//buffer 

//input capture ISR
void __ISR(_INPUT_CAPTURE_1_VECTOR/*, _TxIPL*/) _IC1Interrupt(void) {			//for PIC32
	//clear the flag
	IC1DAT = IC1BUF;					//read the captured value
	IFS0bits.IC1IF = 0;					//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic1_isrptr();						//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic1Init(void) {
	_ic1_isrptr = empty_handler;		//reset user handler

