dannyf00/Another-Arduino-Clone/pic32duino.c
	IC42RP();							//assign pin to IC
	PMD3bits.IC4MD = 0;					//0->enable power to input capture
	IC4CON = 0;							//reset ic4con
	IC4CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
                (0<<13) |				//0->operates in idle, 1->don't operate in idle
                (1<<9) |				//1-.capture rising edge first (only used for ICM110)
                (0<<8) |				//1->32-bit mode, 0->16-bit mode
                (1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
                (0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
                (0<<4) |				//0->ICx no overflow, 1->ICx overflow
                (0<<3) |				//0->buffer is empty, 1->buffer is not empty
                (3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
                0x00;
	IC4CONbits.FEDGE = 1;				//1-.capture rising edge first (only used for ICM110)
	IC4CONbits.ICTMR = 1;				//1->timer2 as timebase, 0->timer3 as timebase
	IC4CONbits.ICM   = 3;				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
	IC4BUF;								//read the buffer to clear the flag
	IFS0bits.IC4IF   = 0;				//0->clear the flag
	IEC0bits.IC4IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	IC4CONbits.ON = 1;					//1->enable the module, 0->disable the module
	//input capture running now
}

//activate user ptr
void ic4AttachISR(void (*isrptr)(void)) {
	_ic4_isrptr = isrptr;				//install user ptr
	IC4BUF;								//read the buffer to clear the flag
	IFS0bits.IC4IF   = 0;				//0->clear the flag
	IEC0bits.IC4IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
	IPC4bits.IC4IP = IC_IPDEFAULT;		//interrupt priority.
	IPC4bits.IC4IS = IC_ISDEFAULT;		//interrupt sur-priority
}

//read buffer value
uint16_t ic4Get(void) {
	return IC4DAT;
}
	
static void (*_ic5_isrptr)(void)=empty_handler;				//function pointer pointing to empty_handler by default
volatile uint16_t IC5DAT=0;				//buffer 

//input capture ISR
void __ISR(_INPUT_CAPTURE_5_VECTOR/*, _TxIPL*/) _IC5Interrupt(void) {			//for PIC32
	//clear the flag
	IC5DAT = IC5BUF;					//read the captured value
	IFS0bits.IC5IF = 0;					//clear the flag after the buffer has been read (the interrupt flag is persistent)
	_ic5_isrptr();						//run user handler
}

//reset input capture 1
//16-bit mode, rising edge, single capture, Timer2 as timebase
//interrupt disabled
void ic5Init(void) {
	_ic5_isrptr = empty_handler;		//reset user handler

	IC52RP();							//assign pin to IC
	PMD3bits.IC5MD = 0;					//0->enable power to input capture
	IC5CON = 0;
	IC5CON  = 	(0<<15) |				//1->enable the module, 0->disable the module
                (0<<13) |				//0->operates in idle, 1->don't operate in idle
                (1<<9) |				//1-.capture rising edge first (only used for ICM110)
                (0<<8) |				//1->32-bit mode, 0->16-bit mode
                (1<<7) |				//1->timer2 as timebase, 0->timer3 as timebase
                (0<<5) |				//0->interrupt on every capture event, 1->on every second capture event, 2->on every 3rd event, 3->on every 4th event
                (0<<4) |				//0->ICx no overflow, 1->ICx overflow
                (0<<3) |				//0->buffer is empty, 1->buffer is not empty
                (3<<0) |				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
                0x00;
	IC5CONbits.FEDGE = 1;				//1-.capture rising edge first (only used for ICM110)
	IC5CONbits.ICTMR = 1;				//1->timer2 as timebase, 0->timer3 as timebase
	IC5CONbits.ICM   = 3;				//0->ICx disabled, 1->every edge, 2->every falling edge, 3->every rising edge, ...
	IC5BUF;								//read the buffer to clear the flag
	IFS0bits.IC5IF   = 0;				//0->clear the flag
	IEC0bits.IC5IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	IC5CONbits.ON = 1;					//1->enable the module, 0->disable the module
	//input capture running now
}

//activate user ptr
void ic5AttachISR(void (*isrptr)(void)) {
	_ic5_isrptr = isrptr;				//install user ptr
	IC5BUF;								//read the buffer to clear the flag
	IFS0bits.IC5IF   = 0;				//0->clear the flag
	IEC0bits.IC5IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
	IPC5bits.IC5IP = IC_IPDEFAULT;		//interrupt priority.
	IPC5bits.IC5IS = IC_ISDEFAULT;		//interrupt sur-priority
}

//read buffer value
uint16_t ic5Get(void) {
	return IC5DAT;
}
//end input capture

//extint
//extint0
void (* _int0_isrptr) (void)=empty_handler;

void __ISR(_EXTERNAL_0_VECTOR) _INT0Interrupt(void) {
	IFS0bits.INT0IF = 0;				//clera the flag
	_int0_isrptr();						//run the isr
}

void int0Init(void) {
	//INT02RP();						//map int0_pin - int0 cannot be remapped
	_int0_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT0IF = 0;				//clear int0 flag
	IEC0bits.INT0IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC0bits.INT0IP = 0;				//interrupt priority.
	IPC0bits.INT0IS = 0;				//interrupt sur-priority
	INTCONbits.INT0EP = 0;				//1=triggered on the falling edge. 0 = rising edge
}

void int0AttachISR(void (*isrptr) (void)) {
	_int0_isrptr = isrptr;
	IFS0bits.INT0IF = 0;				//clear int0 flag
	IEC0bits.INT0IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC0bits.INT0IP = INT_IPDEFAULT;	//interrupt priority.
	IPC0bits.INT0IS = INT_ISDEFAULT;	//interrupt sur-priority
}

//extint1
void (* _int1_isrptr) (void)=empty_handler;

void __ISR(_EXTERNAL_1_VECTOR) _INT1Interrupt(void) {
	IFS0bits.INT1IF = 0;				//clera the flag
	_int1_isrptr();						//run the isr
}

void int1Init(void) {
	INT12RP();							//map int1_pin
	_int1_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT1IF = 0;				//clear int0 flag
	IEC0bits.INT1IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC1bits.INT1IP = 0;				//interrupt priority.
	IPC1bits.INT1IS = 0;				//interrupt sur-priority
	INTCONbits.INT1EP = 0;				//1=triggered on the falling edge. 0 = rising edge
}

void int1AttachISR(void (*isrptr) (void)) {
	_int1_isrptr = isrptr;
	IFS0bits.INT1IF = 0;				//clear int0 flag
	IEC0bits.INT1IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC1bits.INT1IP = INT_IPDEFAULT;	//interrupt priority.
	IPC1bits.INT1IS = INT_ISDEFAULT;	//interrupt sur-priority
}

//extint2
void (* _int2_isrptr) (void)=empty_handler;

void __ISR(_EXTERNAL_2_VECTOR) _INT2Interrupt(void) {
	IFS0bits.INT2IF = 0;				//clera the flag
	_int2_isrptr();						//run the isr
}

