dannyf00/Another-Arduino-Clone/pic32duino.c
void int2Init(void) {
	INT22RP();							//map int1_pin
	_int2_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT2IF = 0;				//clear int0 flag
	IEC0bits.INT2IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC2bits.INT2IP = 0;				//interrupt priority.
	IPC2bits.INT2IS = 0;				//interrupt sur-priority
	INTCONbits.INT2EP = 0;				//1=triggered on the falling edge. 0 = rising edge
}

void int2AttachISR(void (*isrptr) (void)) {
	_int2_isrptr = isrptr;
	IFS0bits.INT2IF = 0;				//clear int0 flag
	IEC0bits.INT2IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC2bits.INT2IP = INT_IPDEFAULT;	//interrupt priority.
	IPC2bits.INT2IS = INT_ISDEFAULT;	//interrupt sur-priority
}

//extint3
void (* _int3_isrptr) (void)=empty_handler;

void __ISR(_EXTERNAL_3_VECTOR) _INT3Interrupt(void) {
	IFS0bits.INT3IF = 0;				//clera the flag
	_int3_isrptr();						//run the isr
}

void int3Init(void) {
	INT32RP();							//map int1_pin
	_int3_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT3IF = 0;				//clear int0 flag
	IEC0bits.INT3IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC3bits.INT3IP = 0;				//interrupt priority.
	IPC3bits.INT3IS = 0;				//interrupt sur-priority
	INTCONbits.INT3EP = 0;				//1=triggered on the falling edge. 0 = rising edge
}

void int3AttachISR(void (*isrptr) (void)) {
	_int3_isrptr = isrptr;
	IFS0bits.INT3IF = 0;				//clear int0 flag
	IEC0bits.INT3IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC3bits.INT3IP = INT_IPDEFAULT;	//interrupt priority.
	IPC3bits.INT3IS = INT_ISDEFAULT;	//interrupt sur-priority
}

//extint4
void (* _int4_isrptr) (void)=empty_handler;

void __ISR(_EXTERNAL_4_VECTOR) _INT4Interrupt(void) {
	IFS0bits.INT4IF = 0;				//clera the flag
	_int4_isrptr();						//run the isr
}

void int4Init(void) {
	INT42RP();							//map int1_pin
	_int4_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT4IF = 0;				//clear int0 flag
	IEC0bits.INT4IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC4bits.INT4IP = 0;				//interrupt priority.
	IPC4bits.INT4IS = 0;				//interrupt sur-priority
	INTCONbits.INT4EP = 0;				//1=triggered on the falling edge. 0 = rising edge
}

void int4AttachISR(void (*isrptr) (void)) {
	_int4_isrptr = isrptr;
	IFS0bits.INT4IF = 0;				//clear int0 flag
	IEC0bits.INT4IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
	IPC4bits.INT4IP = INT_IPDEFAULT;	//interrupt priority.
	IPC4bits.INT4IS = INT_ISDEFAULT;	//interrupt sur-priority
}
//end extint

//spi
//rest spi1
void spi1Init(uint16_t br) {
	PMD5bits.SPI1MD = 0;				//0->enable the module
	
	//map the pins
	
	//initialize the spi module
	//master mode, PBCLK as clock, 8-bit data, enhanced buffer mode
	SPI1CON = 0; 						//reset the spi module
	SPI1CONbits.MSTEN = 1;				//1->master mode, 0->slave mode
	SPI1CONbits.ENHBUF= 1;				//1->enable enhanced buffer mode, 0->disable enhanced buffer mode
	SPI1BRG = br;						//set the baudrate generator
	SPI1BUF;							//read the buffer to reset the flag
	IFS1bits.SPI1TXIF = 0;				//0->reset the flag
	IFS1bits.SPI1RXIF = 0;				//0->reset the flag
	IFS1bits.SPI1EIF  = 0;				//0->reset the flag
	IEC1bits.SPI1TXIE = 0;				//0->disable the interrupt, 1->enable the interrupt
	IEC1bits.SPI1RXIE = 0;				//0->disable the interrupt, 1->enable the interrupt
	IEC1bits.SPI1EIE = 0;				//0->disable the interrupt, 1->enable the interrupt
	SPI1CONbits.ON = 1;					//1->enable the module, 0->disable the module
}

//send data via spi
void spi1Write(uint8_t dat) {
	while (spi1Busy()) continue;		//tx buffer is full
	SPI1BUF = dat;						//load the data
}

//rest spi2
void spi2Init(uint16_t br) {
	PMD5bits.SPI2MD = 0;				//0->enable the module
	
	//map the pins
	
	//initialize the spi module
	//master mode, PBCLK as clock, 8-bit data, enhanced buffer mode
	SPI2CON = 0; 						//reset the spi module
	SPI2CONbits.MSTEN = 1;				//1->master mode, 0->slave mode
	SPI2CONbits.ENHBUF= 1;				//1->enable enhanced buffer mode, 0->disable enhanced buffer mode
	SPI2BRG = br;						//set the baudrate generator
	SPI2BUF;							//read the buffer to reset the flag
	IFS1bits.SPI2TXIF = 0;				//0->reset the flag
	IFS1bits.SPI2RXIF = 0;				//0->reset the flag
	IFS1bits.SPI2EIF  = 0;				//0->reset the flag
	IEC1bits.SPI2TXIE = 0;				//0->disable the interrupt, 1->enable the interrupt
	IEC1bits.SPI2RXIE = 0;				//0->disable the interrupt, 1->enable the interrupt
	IEC1bits.SPI2EIE = 0;				//0->disable the interrupt, 1->enable the interrupt
	SPI2CONbits.ON = 1;					//1->enable the module, 0->disable the module
}

//send data via spi
void spi2Write(uint8_t dat) {
	while (spi2Busy()) continue;		//tx buffer is full
	SPI2BUF = dat;						//load the data
}
//end spi

//i2c

//end i2c

//rtcc
//allows write to rtc registers
#define _RTCC_WREN()			do {di(); SYSKEY=0xaa996655ul; SYSKEY=0x556699aaul; RTCCONbits.RTCWREN = 1; ei();} while (RTCCONbits.RTCWREN == 0)
//do not allow any write to rtc registers - assumes the nvmkey sequence has been sent
#define _RTCC_WRDIS()			do {RTCCONbits.RTCWREN = 0;} while (RTCCONbits.RTCWREN == 1)

//bcd to dec conversion
#define BCD2DEC(bcd)			((((bcd) & 0xf0)>>4)*10+((bcd) & 0x0f))	//convert bcd to int
#define DEC2BCD(dec)			((((dec) / 10)<<4) +((dec) % 10))		//convert int to bcd

//global variables
//struct tm _rtcc;								//rtcc time

//initialize the rtcc
void rtccInit(void) {
	PMD6bits.RTCCMD = 0;						//enable power to rtcc
	_RTCC_WREN();								//allows write to rtc registers
	RTCCON |= 1<<15;							//start the rtc
	_RTCC_WRDIS();
}

//set time
uint32_t rtccSetTime(uint32_t val) {
	_RTCC_WREN();								//enable rtcc write
	di();
	while ((RTCCON & (1<<2)) != 0) continue;	//wait for RTCSYNC=0
	RTCTIME = val;
	ei();
	_RTCC_WRDIS();								//disable rtcc write
	return val;
}

//set date
uint32_t rtccSetDate(uint32_t val) {
	_RTCC_WREN();								//enable rtcc write
	di();
	while ((RTCCON & (1<<2)) != 0) continue;	//wait for RTCSYNC=0
	RTCDATE = val;
	ei();
	_RTCC_WRDIS();								//disable rtcc write
	return val;
}

