dannyf00/Another-Arduino-Clone/pic32duino.c
//write the calibration
uint32_t rtccSetCal(uint32_t offset) {
	_RTCC_WREN();								//allows write to rtc registers
	RTCCON &=~0x03ff0000ul;						//clear the cal registers
	RTCCON |= (offset & 0x3ff) << 16;			//load the offset
	_RTCC_WRDIS();								//disable any write to rfc
	return offset;
}

//read the calibration
uint32_t rtccGetCal(void) {
	signed char tmp;
	_RTCC_WREN();								//allows write to rtc registers
	tmp = RTCCON & 0x03ff0000ul;				//clear the cal registers
	_RTCC_WRDIS();								//disable any write to rfc
	return tmp >> 16;
}

//end rtcc

//cnint
void (* _cna_isrptr) (void)=empty_handler;
void (* _cnb_isrptr) (void)=empty_handler;
#if defined(_PORTC)
void (* _cnc_isrptr) (void)=empty_handler;
#endif

void __ISR(_CHANGE_NOTICE_VECTOR) _CNInterrupt(void) {
	if (IFS1bits.CNAIF) {PORTA; IFS1bits.CNAIF = 0; _cna_isrptr();}	//run the isr
	if (IFS1bits.CNBIF) {PORTB; IFS1bits.CNBIF = 0; _cnb_isrptr();}	//run the isr
#if defined(_PORTC)
	if (IFS1bits.CNCIF) {PORTC; IFS1bits.CNCIF = 0; _cnc_isrptr();}	//run the isr
#endif		
}

//initialize change notification
void cnaInit(uint16_t pins) {
	//enable power - always enabled
	GPIOA->CNCON &=~(1<<15);					//0->disable cn, 1->enable cn
	GPIOA->CNPUSET = pins;						//1->enable pull-up
	GPIOA->CNPDCLR = pins;						//0->disable pull-down
	IFS1bits.CNAIF= 0;							//0->clear the flag
	IEC1bits.CNAIE= 0;							//0->disable the interrupt
	IPC0bits.INT0IP = 0;						//interrupt priority.
	IPC0bits.INT0IS = 0;						//interrupt sur-priority
	IPC8bits.CNIP = 0;							//interrupt priority.
	IPC8bits.CNIS = 0;							//interrupt sur-priority
	GPIOA->CNENSET = pins;						//1->enable cn, 0->disable cn
	GPIOA->CNCON |= (1<<15);					//0->disable cn, 1->enable cn
}

//attach user isr
void cnaAttachISR(void (*isrptr) (void)) {
	_cna_isrptr = isrptr;						//point the isrptr
	IFS1bits.CNAIF= 0;							//0->clear the flag
	IEC1bits.CNAIE= 1;							//0->disable the interrupt
	IPC8bits.CNIP = CN_IPDEFAULT;				//interrupt priority.
	IPC8bits.CNIS = CN_ISDEFAULT;				//interrupt sur-priority
}

//initialize change notification
void cnbInit(uint16_t pins) {
	//enable power - always enabled
	GPIOB->CNCON &=~(1<<15);					//0->disable cn, 1->enable cn
	GPIOB->CNPUSET = pins;						//1->enable pull-up
	GPIOB->CNPDCLR = pins;						//0->disable pull-down
	IFS1bits.CNBIF= 0;							//0->clear the flag
	IEC1bits.CNBIE= 0;							//0->disable the interrupt
	IPC8bits.CNIP = 0;							//interrupt priority.
	IPC8bits.CNIS = 0;							//interrupt sur-priority
	GPIOB->CNENSET = pins;						//1->enable cn, 0->disable cn
	GPIOB->CNCON |= (1<<15);					//0->disable cn, 1->enable cn
}

//attach user isr
void cnbAttachISR(void (*isrptr) (void)) {
	_cnb_isrptr = isrptr;						//point the isrptr
	IFS1bits.CNBIF= 0;							//0->clear the flag
	IEC1bits.CNBIE= 1;							//0->disable the interrupt
	IPC8bits.CNIP = CN_IPDEFAULT;				//interrupt priority.
	IPC8bits.CNIS = CN_ISDEFAULT;				//interrupt sur-priority
}

#if defined(_PORTC)
//initialize change notification
void cncInit(uint16_t pins) {
	//enable power - always enabled
	GPIOC->CNCON &=~(1<<15);					//0->disable cn, 1->enable cn
	GPIOC->CNPUSET = pins;						//1->enable pull-up
	GPIOC->CNPDCLR = pins;						//0->disable pull-down
	IFS1bits.CNCIF= 0;							//0->clear the flag
	IEC1bits.CNCIE= 0;							//0->disable the interrupt
	IPC8bits.CNIP = 0;							//interrupt priority.
	IPC8bits.CNIS = 0;							//interrupt sur-priority
	GPIOC->CNENSET = pins;						//1->enable cn, 0->disable cn
	GPIOC->CNCON |= (1<<15);					//0->disable cn, 1->enable cn
}

//attach user isr
void cncAttachISR(void (*isrptr) (void)) {
	_cnc_isrptr = isrptr;						//point the isrptr
	IFS1bits.CNCIF= 0;							//0->clear the flag
	IEC1bits.CNCIE= 1;							//0->disable the interrupt
	IPC8bits.CNIP = CN_IPDEFAULT;				//interrupt priority.
	IPC8bits.CNIS = CN_ISDEFAULT;				//interrupt sur-priority
}
#endif 	//_PORTC
//end cnint
